<?php
$images = get_field('images', $product->ID);
$image = !empty($images) ? $images[0] : '';
$vendorCode = get_field('vendor_code', $product->ID);
$materials = get_the_terms($product->ID, 'product-material');
$title = $product->post_title;
$link = get_post_permalink($product->ID);
$dataOverlay = getOverlayClass($product);
?>

<a href="<?= $link ?? '' ?>" class="product-card">
    <div class="product-card__top">
        <svg class="product-card__top-cursor" xmlns="http://www.w3.org/2000/svg" width="44" height="44"
             viewBox="0 0 44 44" fill="none">
            <path d="M12.2358 0H30.3008L44 12.9721V31.5538L31.3008 44H12.6992L0 31.5538V12.9721L12.2358 0Z"
                  fill="#FF893E"/>
            <path d="M29.6703 21.5624C29.6438 21.4188 29.557 21.2979 29.4323 21.2224C26.5613 19.5111 24.8765 19.156 23.645 18.8992C23.4864 18.8652 23.3315 18.8349 23.1842 18.8009L22.6515 14.4227C22.6326 13.4557 21.8394 12.6699 20.8685 12.6699C19.909 12.6699 19.1346 13.4103 19.0855 14.3623C19.0855 14.3812 19.0817 14.3963 19.0817 14.4152V16.9915L19.0402 23.2812L18.3602 22.7561C18.228 22.6427 17.3063 21.8986 16.1654 21.8986C15.3948 21.8986 14.7111 22.2234 14.1331 22.8581C13.9706 23.0356 13.9555 23.3 14.0953 23.4965C14.1444 23.5645 15.3155 25.2039 17.1514 26.8736C18.2393 27.8596 19.3348 28.6491 20.4076 29.2195C21.7751 29.9448 23.1124 30.3188 24.3854 30.3301C24.4043 30.3301 24.427 30.3301 24.4459 30.3301C26.1836 30.3301 27.5359 29.7559 28.4652 28.6264C30.5353 26.1106 29.7043 21.7475 29.6703 21.5624ZM27.6757 27.9842C26.9504 28.8682 25.8625 29.314 24.4459 29.314C24.427 29.314 24.4119 29.314 24.393 29.314C21.8658 29.2951 19.4406 27.5763 17.854 26.137C16.5885 24.9886 15.6328 23.8327 15.1946 23.266C15.493 23.0356 15.8141 22.9223 16.1692 22.9223C16.9889 22.9223 17.6991 23.5305 17.7029 23.538C17.7105 23.5456 17.7218 23.5531 17.7293 23.5607L19.2366 24.7204C19.3915 24.8375 19.5955 24.8602 19.773 24.7733C19.9468 24.6902 20.0563 24.5126 20.0601 24.32L20.1092 16.999V14.4492C20.1092 14.4454 20.1092 14.4378 20.1092 14.4341C20.1206 14.0185 20.4568 13.6936 20.8723 13.6936C21.2954 13.6936 21.6354 14.0374 21.6354 14.4567C21.6354 14.4756 21.6354 14.4983 21.6391 14.5172L22.2096 19.2731C22.236 19.4809 22.3833 19.6509 22.5835 19.7038C22.8555 19.7756 23.1351 19.836 23.4335 19.8964C24.6272 20.1458 26.108 20.4593 28.707 21.9779C28.8354 22.8543 29.2019 26.1294 27.6757 27.9842Z"
                  fill="white"/>
        </svg>
        <picture>
            <img loading="lazy" src="<?= $image['url'] ?? '' ?>" alt="<?= $image['title'] ?? '' ?>">
        </picture>
    </div>
    <div class="product-card__bottom">
        <p class="product-card__title"> <?= $title ?? '' ?> </p>
        <p class="product-card__vendor-code">Артикул: <?= $vendorCode ?? '' ?> </p>
        <?php if (!empty($materials)) : ?>
            <div class="product-card__materials">
                <p class="product-card__material-title">Материал:</p>
                <?php foreach ($materials as $material) : ?>
                    <p class="product-card__material"> <?= $material->name ?><?= end($materials) !== $material ? ',' : '' ?></p>
                <?php endforeach; ?>
            </div>
        <?php endif; ?>
    </div>
    <?php if (!empty($dataOverlay)) : ?>
        <div class="<?= $dataOverlay['class'] ?>"><?= $dataOverlay['name'] ?></div>
    <?php endif; ?>
</a>